In [8]:
import numpy as np
import pandas as pd

In [9]:
# settig the seed to a certain value so the genrated values remain same for every one 
np.random.seed(101)

## creating a data frame

In [10]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [12]:
# resulting data frame 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## indexing and selecting

In [14]:
# passing cloumn name 
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [15]:
# selecting multiple columns by passing a list of values 
df[['Z','W','X']]

          Z         W         X
A  0.503826  2.706850  0.628133
B  0.605965  0.651118 -0.319318
C -0.589001 -2.018168  0.740122
D  0.955057  0.188695 -0.758872
E  0.683509  0.190794  1.978757

In [16]:
# selcting columns using dot notations 
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

# adding new columns to the dataframe

In [25]:
df['SAYMA'] = df['W']+df['Y']

In [26]:
df

          W         X         Y         Z     SAYMA
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

# removing columns

In [27]:
# removing columns using drop method 
# axis = 1 for columns 
# delete completely(or make changes permanent) set inplace = True 
df.drop('SAYMA',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# removing rows using

In [30]:
# to make the change permanent set inplace = True 
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

# fetching rows using loc method

In [32]:
# have to pass the row name / label 
# gives values from each column
df.loc['E']

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

# fecthing using index position using iloc method

In [33]:
# have to pass the corresponding index value 
# indexing starts with 0 and goes up to N number of rows 
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

## fecthing a particular single cell using loc method

In [37]:
# have to use both row and column
# for example we have to fetch 0.528813 
# loc[row name][column name]
df.loc['C']['Y']

0.5288134940893595

## getting a subset or slice from the dataframe similar to 2D matrix

In [46]:
# have to pass row and cloumn name unike 2D array numeric value is now used 
# have to pass the names of all the rows and cloums to be included in the subset 

df.loc[['B','C','D'],['X','Y']]

          X         Y
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# conditional selection